#coding:utf
#这是一个实验，关于使用排山倒海数据的，这个数据线文件是第17页，世纪学习实战的身体是企业的一个例子，这里怎么打也打不变，我希望自己能从这个例子中好好学习一下，把我给你吃药不能长时间的事，我想今晚上，他们早上起来一定会做这个事情，这是音标练习的骄傲，最近邻算法大概的意思就是说我通过一些数据有没有出处？两个数的距离，然后得看看自己是不是极品，然后去前几个，然后就前几个的几个基本上就是，你说你可以随时监听，那你就是那种离别了多种方式来得到那边，第一个函数的话呢，这是，来源显示，几个。点，还有它们的类别，创建一个函数，就还是我都没想到，原来通过这个方式跟小孩说，

from numpy import *
import operator#这个运算符，这个算法在执行排序操作时，将使用这个模块提供的函数，后面将进一步介绍，
#为了方便使用这个函数，我们创建了数据集合，标签，然后那一次执行以下步骤，保存文件，改变当前路径到存储文件的位置，打开这个开发环境，无论什么时候系统做，打开终端，用命令提示符，完了你上手操作，只要我们默认安装好的东西，然后输出输入相应的命令的时候，就可以进入开发环境，然后呢我们按照下列命令导入上面程序的，模块，看来这个文件要背别的引用，
def createDataSet():
    group = array(
        [
            [
                1.0,
                1.1
            ],
            [
                1.0,
                1.0
            ],
            [0,0],
            [0,0.1]
        ]
    )#注意这个地方可能出错了，少了一个中国号，也就是说里面做的数据,不是一个数组，
    labels = ['A','A','B','B']
    return group, labels